commands_templates/GetReplayUri0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/replay/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:GetReplayUri>
         <wsdl:StreamSetup>
            <!--type: StreamType - enumeration: [RTP-Unicast,RTP-Multicast]-->
            <sch:Stream>?</sch:Stream>
            <sch:Transport>
               <!--type: TransportProtocol - enumeration: [UDP,TCP,RTSP,HTTP]-->
               <sch:Protocol>?</sch:Protocol>
               <!--Optional:-->
               <sch:Tunnel/>
            </sch:Transport>
            <!--You may enter ANY elements at this point-->
         </wsdl:StreamSetup>
         <!--type: ReferenceToken-->
         <wsdl:RecordingToken>?</wsdl:RecordingToken>
      </wsdl:GetReplayUri>
   </soap:Body>
</soap:Envelope>